app/controllers/books_controller.rb

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "ポッター2"], ["updated_at", "2021-05-16 15:07:12.428261"], ["id", 6]]

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    @user = current_user
    if @book.save
    redirect_to book_path(@book),notice: "successfully"
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "aaa"], ["body", "aaaa"], ["created_at", "2021-05-18 04:57:04.765777"], ["updated_at", "2021-05-18 04:57:04.765777"], ["user_id", 17]]
SELECT "books".* FROM "books"

  def index
    @user = current_user
    @book = Book.new
    @books = Book.all
---
SELECT "books".* FROM "books"