app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]