app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @book = Book.new
    @books = Book.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 15]]

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "73e2092d8d17bcaba28985a062d56d2d97490ecc50c54de91b51419da69f"], ["updated_at", "2021-05-16 17:27:36.849423"], ["id", 14]]